//beep.h

#ifndef __BEEP_H
#define __BEEP_H

#include <stdint.h>

//============================================================================
// 函数名称: Beep_BlockRun()
// 功能描述: 阻塞响蜂鸣器
// 输　  入: cnt 响几声 ONt 响时长
// 输    出:
// 函数说明: 
//============================================================================
//void Beep_BlockRun(uint8_t cnt, uint8_t ONt);

//============================================================================
// 函数名称: Beep_RunStatus()
// 功能描述:
// 输　  入:
// 输    出:
// 函数说明: 10ms 中断
//============================================================================
void Beep_RunStatus(void);

#endif  //__BEEP_H








