//handledata.h

#ifndef __HANDLEDATA_H
#define __HANDLEDATA_H

#include <stdint.h>

//============================================================================
// 函数名称: HandleData_No1()
// 功能描述:
// 输　  入:
// 输    出:
// 函数说明: No.1 【分离式，无霍尔（）】
//============================================================================
void HandleData_No1(uint8_t Number, uint8_t *Param);


//============================================================================
// 函数名称: HandleData_No2()
// 功能描述:
// 输　  入:
// 输    出:
// 函数说明: No.2 【分离式，有霍尔（PXBA、PXBB）】
//============================================================================
void HandleData_No2(uint8_t Number, uint8_t *Param);


//============================================================================
// 函数名称: Interface_No3()
// 功能描述:
// 输　  入:
// 输    出:
// 函数说明: No.3 【一体式】
//============================================================================
void HandleData_No3(uint8_t Number, uint8_t *Param);

//============================================================================
// 函数名称: HandleData_No21()
// 功能描述: 
// 输　  入: 
// 输    出: 
// 函数说明: No.2-1（14芯设别原本属于8芯设别的手柄）
//============================================================================
void HandleData_No21(uint8_t Number, uint8_t *Param);

#endif  //__HANDLEDATA_H



