//UI_Start.h

#ifndef __UI_START_H
#define __UI_START_H

//============================================================================
// 函数名称: UI_Start_Fun()
// 功能描述: 起始页
// 输　  入:
// 输    出: 0返回主界面 1下一页
// 函数说明: 开机扫描”LOGO点击动作“ 进入厂家配置 4s等待...
//============================================================================
void UI_Start_Fun(void);

//============================================================================
// 函数名称: UI_Show_init()
// 功能描述: UI主界面初始化
// 输　  入:
// 输    出:
// 函数说明:
//============================================================================
void UI_Show_init(void);

#endif  //__UI_START_H


